<h1>Working with rests</h1>

<subsection>Rest initialization
<p>Initialize <Rest> with a <Rational>.</p>
<abjad>
   abjad> rest = Rest(Rational(1, 4))
   hide> measure = Measure(rest.duration.prolated.pair, [rest])
   hide> measure.meter.transparent = True
   hide> show(measure)
</abjad>
<p>You can use any <duration token> as a shortcut.</p>
</subsection>

<subsection>Duration attributes
<p><Rest> has a <_LeafDurationInterface>.</p>
<abjad>
   abjad> tuplet = FixedDurationTuplet((1, 4), [Note(0, (1, 8)), Rest((1, 8)), Note(0, (1, 8))])
   abjad> rest = tuplet[1]
   abjad> rest.duration
   &lt;abjad.leaf.duration._LeafDurationInterface object at 0x6eab0&gt;
</abjad>
<p><_LeafDurationInterface> bundles six public attributes.</p>
<abjad>
   hide> tuplet = FixedDurationTuplet((1, 4), [Note(0, (1, 8)), Rest((1, 8)), Note(0, (1, 8))])
   hide> rest = tuplet[1]
   abjad> rest.duration.multiplied
   Rational(1, 8)
</abjad>
<abjad>
   hide> tuplet = FixedDurationTuplet((1, 4), [Note(0, (1, 8)), Rest((1, 8)), Note(0, (1, 8))])
   hide> rest = tuplet[1]
   abjad> rest.duration.multiplier
   Rational(1, 1)
</abjad>
<abjad>
   hide> tuplet = FixedDurationTuplet((1, 4), [Note(0, (1, 8)), Rest((1, 8)), Note(0, (1, 8))])
   hide> rest = tuplet[1]
   abjad> rest.duration.preprolated
   Rational(1, 8)
</abjad>
<abjad>
   hide> tuplet = FixedDurationTuplet((1, 4), [Note(0, (1, 8)), Rest((1, 8)), Note(0, (1, 8))])
   hide> rest = tuplet[1]
   abjad> rest.duration.prolated
   Rational(1, 12)
</abjad>
<abjad>
   hide> tuplet = FixedDurationTuplet((1, 4), [Note(0, (1, 8)), Rest((1, 8)), Note(0, (1, 8))])
   hide> rest = tuplet[1]
   abjad> rest.duration.prolation
   Rational(2, 3)
</abjad>
<abjad>
   hide> tuplet = FixedDurationTuplet((1, 4), [Note(0, (1, 8)), Rest((1, 8)), Note(0, (1, 8))])
   hide> rest = tuplet[1]
   abjad> rest.duration.written
   Rational(1, 8)
</abjad>
<p>Read more at <_LeafDurationInterface>.</p>
</subsection>

<subsection>Duration attribute assignment
<p>You can reassign <tt>rest.duration.written</tt>.</p>
<abjad>
   abjad> rest = Rest(Rational(1, 4))
</abjad>
<abjad>
   hide> rest = Rest(Rational(1, 4))
  abjad> rest.duration.written = Rational(3, 16)
  hide> measure = Measure(rest.duration.prolated.pair, [rest])
  hide> measure.meter.transparent = True
  hide> show(measure)
</abjad>
<p>Use must use a <Rational> which meets <assignability> criteria.</p>
<p>You can also assign <tt>rest.duration.multiplier</tt>.</p>
<abjad>
   abjad> rest = Rest(Rational(1, 4))
   abjad> rest.duration.multiplier = Rational(1, 6)
</abjad>
<abjad>
   hide> rest = Rest(Rational(1, 4))
   hide> rest.duration.mutiplier = Rational(1, 6)
   abjad> rest.duration.written
   Rational(1, 4)
   abjad> rest.duration.multiplier
   Rational(1, 6)
   abjad> rest.duration.multiplied
   Rational(1, 24)
</abjad>
<p>Use any positive <Rational>.</p>
<p>All other duration attributes are read-only.</p>
</subsection>

<subsection>Using pitch as a vertical positioner
<p>
In addition to the attributes inherited from the <_Leaf> class (such as <strong>duration</strong>, <strong>grace</strong>, etc.), the <Rest> class also possesses a <strong>pitch</strong> attribute. 
This may seem strange given that rests represent the absence of sound. 
However, as a glyph in a score, rests also necessarily have a vertical position relative to the staff. 
By default the vertical position of rests is set automatically by the LilyPond renderer, but it can be set arbitrarily with the <strong>pitch</strong> attribute. 
</p>
<abjad>
   hide> rest = Rest((1, 4))
   abjad> rest.pitch = -1
   hide> measure = Measure(rest.duration.prolated.pair, [rest])
   hide> measure.meter.transparent = True
   hide> show(measure)
</abjad>
<p>Notice how the position of the rest is here moved down so it falls exactly on B<sub>3</sub>.</p>
<p>To remove pitch from a rest, simply set pitch to None.</p>
<abjad>
   hide> rest = Rest((1, 4))
   hide> rest.pitch = -1
   abjad> rest.pitch = None
   hide> measure = Measure(rest.duration.prolated.pair, [rest])
   hide> measure.meter.transparent = True
   hide> show(measure)
</abjad>
</subsection>
